app/Controllers/MainController.php

SELECT *
FROM `discos`
---
    public function index()
    {
        $DiscoModel = new DiscoModel();
        $discos = $DiscoModel->findAll();

SELECT *
FROM `autoria`
---
    public function adicionar()
    {
    $AutoriaModel = new AutoriaModel();

    $autorias = $AutoriaModel->findAll();

INSERT INTO `discos` (`nome`, `autoria`, `genero`, `lancamento`) VALUES ('Naturalidade', 'PumaPJL', 'Rap', '2020')
---
    public function salvar()
    {
        $request = $this->request;

        $DiscoModel = new DiscoModel();

        $data = [
            'nome' => $request->getPost('nome'),
            'autoria' => $request->getPost('autoria'),
            'genero' => $request->getPost('genero'),
            'lancamento' => $request->getPost('lancamento'),
        ];

        $DiscoModel->insert($data);

SELECT *
FROM `discos`
WHERE `discos`.`nome` = 'Channel Orange'
---
    public function editar($nome)
    {
    $DiscoModel = new DiscoModel();
    $discos = $DiscoModel->find($nome);

DELETE FROM `discos`
WHERE `nome` IN ('Naturalidade')
---
    public function remover($nome)
    {
    $discoModel = new DiscoModel();
    $discoModel->delete($nome);

SELECT *
FROM `autoria`
SELECT *
FROM `discos`
---
    public function autoria()
    {
    $AutoriaModel = new AutoriaModel();
    $autorias = $AutoriaModel->findAll();

    $DiscoModel = new DiscoModel();
    $discos = $DiscoModel->findAll();

INSERT INTO `autoria` (`nomeAutoria`) VALUES ('PumaPJL')
---
    public function salvarAutoria()
    {
        $request = $this->request;

        $AutoriaModel = new AutoriaModel();

        $data = [
            'nomeAutoria' => $request->getPost('nomeAutoria'),
        ];

        $AutoriaModel->insert($data);

DELETE FROM `autoria`
WHERE `nomeAutoria` IN ('PumaPJL')
---
    public function removerAutoria($nomeAutoria)
    {
    $AutoriaModel = new AutoriaModel();
    $AutoriaModel->delete($nomeAutoria);